HangX-Ma/MiniScpoe-STC8A/User/src/main.c
/**
 * @file main.c
 * @author MContour (m-contour@qq.com)
 * @brief main program
 * @version 0.1
 * @date 2022-05-06
 * 
 * @copyright Apache 2.0 LICENSE
 * 
 *****************************************************************************
 * Copyright (c) 2022 MContour m-contour@qq.com
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 *     http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *****************************************************************************
 */

/* TM0: VBAT info updating rate */
/* TM1: Keys press types recognition, short or long */
/* TM3: UART1 Rx out of time */

/*
    -----------------------------------------  [INTRODUCTION]  -----------------------------------------
    OPERATION INTRO:
        Main Interface - Options Selection Mode: 
            SW Button:              Switch Stop/Run
            Short Press SETTING:    Switch to [Waveform Horizontal Scroll Mode]
            SEL:                    Select or de-select this option.
            NEXT/INC:               Jump to next option or increase value.
            LAST/DEC:               Jump to last option or decrease value.


        Main Interface - Waveform Horizontal Scroll Mode:
            SW Button:              Switch Stop/Run
            Short Press SETTING:    Switch to [Options Selection Mode]
            [SEL] SET(Horizontal waveform scroll, Valid in suspended sampling state):
                NEXT/INC:           Jump to next option or increase value.
                LAST/DEC:           Jump to last option or decrease value.
            [SEL] RESET(Vertical waveform scroll, Valid in suspended sampling state):
                NEXT/INC:           Jump to next option or increase value.
                LAST/DEC:           Jump to last option or decrease value.

        Setting Interface: (SETTING)
            Long Press SETTING: Return to main interface or enter setting interface from main interface.
            SEL:                    Select or de-select this option.
            NEXT/INC:               Jump to next option or increase value.
            LAST/DEC:               Jump to last option or decrease value.
    ----------------------------------------------------------------------------------------------------
    MAIN INTERFACE INTRO:
        Vertical Time Range:     "500ms", "200ms", "100ms", "50ms", "20ms", "10ms","5ms", "2ms", "1ms", "500us", "200us", "100us"(100us only used in AUTO Mode)
        Horizontal Voltage Range: Set voltage upper range, whose maximum value is 30V. If the voltage upper range is set to '0', system run into AUTO mode.
        Trigger Value:            Set trigger voltage value. The trigger position is set to the screen center.
        Trigger Direction:        Use up or down arrow indicator, separately representing rising edge trigger and falling edge trigger.
        Trigger Mode:
            AUTO:   Sample continuously, whose indicator led is always turned on. SW Button is used to select RUN or STOP;
                    If trigger process is successful, trigger position is set to the screen center, otherwise the waveform scrolling irregularly. FAIL will be shown.
            NORMAL: Wait for prerequisite sampling. Indicator led is turned on, indicating the prerequisite sampling finished. Signal can be entered.
                    After successfully triggering, display the waveform, and continue to wait for the next trigger;
                    If a new trigger is successful, the new waveform will be displayed automatically. If no new trigger is successful, the screen waveform will remain and wait for the next trigger;
                    (Be careful to set the correct trigger value, otherwise has been waiting for the trigger state, the screen will not display the waveform)
            SINGLE: Wait for prerequisite sampling. Indicator led is turned on, indicating the prerequisite sampling finished. Signal can be entered.
                    After triggering successfully, display the waveform and stop sampling, the user needs to click on the encoder to start the next sampling.
                    (Be careful to set the correct trigger value, otherwise has been waiting for the trigger state, the screen will not display the waveform)
    ----------------------------------------------------------------------------------------------------
    OPTIONS SETTING SAVING:
        Long press SETTING key to leave the setting interface. If options have been changed, the program will save the setting to EEPROM.
    ----------------------------------------------------------------------------------------------------
    MAIN INTERFACE STATUS: 
        RUN:        Sampling in progress 
        STOP:       Stop Sampling 
        FAIL:       In AUTO mode, trigger value exceeds waveform range causing trigger failure 
        SUCC:       In automatic mode, the trigger value displays the trigger success in the waveform range.
        Auto:       Auto range.
    ----------------------------------------------------------------------------------------------------
    SETTING INTERFACE STATUS: 
        PMODE (drawing mode) : 
            Vector: waveform display using vector 
            Dots:   waveform display using dots
            LSB (sampling factor) : 100 times the partial voltage factor, (8.2K+2K)/2K*100 = 510. Adjust this value subtly in accordance with actual register values.
            BRT:    OLED brightness
    ----------------------------------------------------------------------------------------------------
 */
#include "main.h"
#include "STDIO.H"
#include "STDLIB.H"
#include "STRING.H"
#include "stc8x_sysclk.h"


bit ifKeyPressed;
static uint8_t keyPressedTimeCount;

/**
 * @brief Rewrite 'putchar' function, remapped to UARTx output
 * 
 * @param c input character
 * @return char 
 */
char putchar (char c) {
    UARTx_Send(c);

    return c;
}


int main (void) {
    /* Set OLED port P2.3, P2.4, P2.5, P2.6, P2.7 as quasi bidirectional */
    P2M1 &= ~0xF8;
    P2M0 &= ~0xF8;
    /* Set ADC port P0.4, P0.6 as high-impedance */
    P0M1 |= 0x50;
    P0M0 &= ~0x50;
    /* P2.0(SEL), P2.1(LAST/DEC), P2.2(EX) as high-impedance */
    P2M1 |= 0x07;
    P2M0 &= ~0x07;
    /* Set P4.1(SETTING), P4.2(NEXT/INC) as high-impedance */
    P4M1 |= 0x06;
    P4M0 &= ~0x06;
    /* Set Button P3.2 as high-impedance */
    P3M1 &= ~0x04;
    P3M0 &= ~0x04;
    /* Set indicator port P3.5 as push-pull output */
    P3M1 &= ~0x20;
    P3M0 |= 0x20;

