HangX-Ma/MiniScpoe-STC8A/User/src/main.c
    P_SW2  |= P_SW2_EAXFR;
    /* Falling edge interrupt */
    P2IM0  &= ~0x07;
    P2IM1  &= ~0x07;
    P4IM0  &= ~0x06;
    P4IM1  &= ~0x06;
    /* Lowest Priority */
    PINIPL &= ~0x14;
    PINIPH &= ~0x14;
    /* Enable I/O interrupt */
    P2INTE |= 0x07;
    P4INTE |= 0x06;
    P_SW2 &= ~P_SW2_EAXFR;


    Switch_Init();
    TM0_Init();
    UART1_Init();
    TM1_Init();
    Read_Options();
    GlobalVar_Init();
    delay_nus(50);

    /* OLED initialization */
    OLED_Init();
    OLED_SetFontWidth(6);
    PlotChart();
    OLED_Display();

    EA = SETBIT;


    while (1) {
        /* Update voltage infor of battery */
        if (G_UpdateVBAT_FLAG) {
            VBAT = Get_BATV(ADC_CONTR_ADC_CHS_VAL12, VBAT_RATIO);
            G_UpdateVBAT_FLAG = CLRBIT;
        }

        GetWaveData(); // Sample waveform

        if (G_State_Settings_FLAG) {
            runWhenInSettings();
        } // Enter Settings Interface
        else if (G_ADC_Interrupt_FLAG) {
            runWhenADCInterrupt();
        } // ADC Sampling Interrupt
        else {
            runWhenADCComplete();
        } // ADC Sampling Complete
    }

    return 0;
}

void runWhenInSettings(void) {
    ADC_Sample_Ready_LED = CLRBIT;
    G_ClearDisplay_FLAG  = SETBIT;

    while (G_State_Settings_FLAG) {
        /* Update battery voltage information */
        if (G_UpdateVBAT_FLAG) {
            G_UpdateVBAT_FLAG = CLRBIT;
            VBAT = Get_BATV(ADC_CONTR_ADC_CHS_VAL12, VBAT_RATIO);
        }

        /* Update OLED Brightness */
        if (G_OLED_BrightnessChanged_FLAG) {
            G_OLED_BrightnessChanged_FLAG = CLRBIT;
            OLED_WR_CMD(0x81);
            OLED_WR_CMD(G_OLED_Brightness * 10);
        }

        /* Update parameters */
        if (G_DisplayUpdate_FLAG) {
            G_DisplayUpdate_FLAG = CLRBIT;
            PlotSettings();
            OLED_Display();
        }
    }

    /* Save Settings */
    EA = CLRBIT;
    if (G_State_OptionChanged_FLAG){
        G_State_OptionChanged_FLAG  = CLRBIT;
        G_ClearDisplay_FLAG         = CLRBIT;
        /* Save settings and display saving status*/
        PlotSaveStatus(Save_Options());
        OLED_Display();
        delay_nms(1000);
    }

    /* Refresh screen after exiting settings */
    G_ClearDisplay_FLAG = SETBIT;
    PlotChart();
    OLED_Display();
    EA = SETBIT;
}


/*
    ADCRuning=1
    |   WaveUpdate=1
    |   |   ClearWave=1
    |   |   ClearWave=0
    |   WaveUpdate=0
    ADCRuning=0
        DisplayUpdate=1
            WaveUpdate=1
            |   ClearWave=1
            |   ClearWave=0
            WaveUpdate=0
*/
void runWhenADCInterrupt(void) {
    G_ADC_Interrupt_FLAG = CLRBIT;
    ADC_Sample_Ready_LED = CLRBIT;

    if (G_ADC_Running_FLAG) {
        P_SW2  |= P_SW2_EAXFR;
        /* Disable I/O interrupt P4.2, P2.1 */
        P2INTE &= ~0x02;
        P4INTE &= ~0x04;
        P_SW2 &= ~P_SW2_EAXFR;

        if (G_WaveUpdate_FLAG) {
            G_WaveUpdate_FLAG   = CLRBIT;
            G_ClearDisplay_FLAG = SETBIT;

            if (G_ClearWave_FLAG) {
                G_ClearWave_FLAG = CLRBIT;
                memset(ADCbuf, 0x00, ADC_SAMPLE_BUF_SIZE * 2);
                G_WaveFreq          = 0;
                G_TriggerFail_FLAG  = CLRBIT;
                G_VMax              = 0;
                G_VMin              = 0;
                PlotChart();
            } // Clear waveform in buffer
            else {
                AnalyzeData();
                PlotChart();
                PlotWave();
            } // Display waveform in buffer
        }
        else {
            G_ClearDisplay_FLAG = CLRBIT;
            PlotChart();
        }
        OLED_Display();

        /* Not to enable external interrupt 0(Encoder Rotation) when both of ADCRunning and WaveScroll set. */
        if (!G_WaveScroll_FLAG) {
            TCON_IE0    = CLRBIT;
            P_SW2  |= P_SW2_EAXFR;
            /* Enable I/O interrupt P4.2, P2.1 */
            P2INTE |= 0x02;
            P4INTE |= 0x04;
            P_SW2 &= ~P_SW2_EAXFR;
        }
    } // ADC Sampling Running
    else {
        while (!G_ADC_Running_FLAG && !G_State_Settings_FLAG) {
            if (G_DisplayUpdate_FLAG) {
                 P_SW2  |= P_SW2_EAXFR;
                /* Disable I/O interrupt P4.2, P2.1 */
                P2INTE &= ~0x02;
                P4INTE &= ~0x04;

                G_DisplayUpdate_FLAG = CLRBIT;
                if (G_WaveUpdate_FLAG) {
                    G_WaveUpdate_FLAG = CLRBIT;
                    /* Analyze completed sampling data in buffer */
                    AnalyzeData();
                    G_ClearDisplay_FLAG = SETBIT;

                    /* Clear display and draw waveform */
                    if (G_ScaleH == G_ScaleH_tmp) {
                        /* Since the sampling points limitation, scaling waveform along horizontal is not support.
                           Show waveform only when time scale is same as that when sampling completed */
                        PlotChart();
                        PlotWave();
                    }
                    else {
                        G_WaveFreq = 0; //Clear G_WaveFreq，display '****Hz'
                        PlotChart();
                    }
                } // Clear display and draw no waveform
                else
                {
                    G_ClearDisplay_FLAG = CLRBIT;
                    PlotChart();
                } // Update parameters on display only and maintain waveform

                OLED_Display();
                TCON_IE0    = CLRBIT;

                /* Enable I/O interrupt P4.2, P2.1 */
                P2INTE |= 0x02;
                P4INTE |= 0x04;
                P_SW2 &= ~P_SW2_EAXFR;
            }
        } // ADC Sampling Stopped 
    }
}


void runWhenADCComplete() {
    if (G_TriggerMode == TriggerSel_Single)
    {
        P_SW2  |= P_SW2_EAXFR;
        /* Disable I/O interrupt P4.2, P2.1 */
        P2INTE &= ~0x02;
        P4INTE &= ~0x04;
        G_ADC_Interrupt_FLAG    = SETBIT;
        G_DisplayUpdate_FLAG    = CLRBIT;
        G_WaveUpdate_FLAG       = CLRBIT;
        G_ADC_Running_FLAG      = CLRBIT; // ADC Stop running 
        AnalyzeData();
        G_ClearDisplay_FLAG     = SETBIT;
        PlotChart();
        PlotWave();
        OLED_Display();
        TCON_IE0                = CLRBIT;
        /* Enable I/O interrupt P4.2, P2.1 */
        P2INTE |= 0x02;
        P4INTE |= 0x04;
        P_SW2 &= ~P_SW2_EAXFR;
    } // ADC Sampling Complete - Single Trigger Mode
    else {
        G_ClearDisplay_FLAG     = SETBIT;   // Reset screen clearance flag
        AnalyzeData();                      // Analyze sampled data
        PlotChart();                        // Draw main interface
        PlotWave();                         // Draw waveform
        OLED_Display();
    } // ADC Sampling Complete - Auto or Normal Trigger Mode
}



void GlobalVar_Init(void) {
    G_State_Settings_FLAG         = CLRBIT;                 // Not enter setting interface
    G_WaveScroll_FLAG             = CLRBIT;                 // Not enable waveform scroll

    G_UpdateVBAT_FLAG             = CLRBIT;                 // Reset battery update flag
    G_OLED_BrightnessChanged_FLAG = CLRBIT;                 // Reset OLED brightness update flag
    G_State_OptionChanged_FLAG    = CLRBIT;                 // Reset option changed flag

