HangX-Ma/MiniScpoe-STC8A/User/src/main.c
    /* Default ADC functions state */
    G_ADC_Running_FLAG            = SETBIT;                 // Set ADC running flag
    G_ADC_Interrupt_FLAG          = CLRBIT;                   // Reset ADC interrupt flag
    G_ADC_Complete_FLAG           = CLRBIT;                   // Reset ADC conversion complete flag

    /* Default Option for [setting interface] and [main interface]*/
    G_OptionInSettings            = SettingSel_PlotMode;    // default: PlotMode
    G_OptionInChart               = ChartSel_ScaleH;        // default: ScaleH
    G_MeasureWaySel               = MeasureWay_AC;          // default: AC measure way
    G_PlotModeSel                 = PlotMode_Vector;        // default: Vector

    /* Display setting */
    G_ClearDisplay_FLAG           = SETBIT;                 // Set clearing display flag
    G_ClearWave_FLAG              = CLRBIT;                 // Reset waveform erasing flag
    G_WaveUpdate_FLAG             = CLRBIT;                 // Reset waveform update flag

    /* Indicator */
    ADC_Sample_Ready_LED          = CLRBIT;                 // ADC sampling indicator off
    ifKeyPressed                  = CLRBIT;                 // Initially, keys are not pressed

    /* Basic Config */
    G_VMax_Modified             = 0;
    G_VMin_Modified             = 0;
    G_Voltage_Modified          = 0;
    G_VolV_Max_Modified         = 0;

    G_Bias_Voltage              = 8900;                     // Bias voltage weight

    /* Waveform Config */
    G_VMax                      = 0;                        // Clear maximum waveform voltage
    G_VMin                      = 0;                        // Clear minimum waveform voltage
    G_WaveAvgLengthSumNum       = 0;                        // Clear average waveform length sum counts
    G_WaveAvgLengthSum          = 0;                        // Clear average waveform length sum
    G_WaveFreq                  = 0;                        // Clear waveform frequency

    /* Trigger Config */
    G_TriggerPos                = 50;                       // Set initial trigger position
    G_TriggerPosOffset          = 0;                        // Set initial trigger offset
    G_TriggerFail_FLAG          = CLRBIT;                   // Reset trigger failure flag
    G_TriggerLevel_mV_Modified  = 2000;

    /* Disable external key interrupt [NEXT/INC] and [LAST/DEC] in waveform scroll mode when sampling */
    if (G_ADC_Running_FLAG && G_WaveScroll_FLAG) {
        P_SW2  |= P_SW2_EAXFR;
        /* Disable I/O interrupt P4.2, P2.1 */
        P2INTE &= ~0x02;
        P4INTE &= ~0x04;
        P_SW2 &= ~P_SW2_EAXFR;
    } 

    BGV_RAM                       = Get_RAM_REFV();
}


void Switch_Init(void) {
    TCON_IT0 = CLRBIT;   // Enable INT0, rising edge and falling edge interrupt

    /* External interrupt 0 level 1 priority, which can interrupt the key pressing, 
    used to identified a state that switch button is pressed or not. */
    PX0      = SETBIT; 
    EX0      = SETBIT; // Start external interrupt 0
}

void TM0_Init(void) {
    /* Timer 0, for updating voltage of battery */
    AUXR     &= ~AUXR_T0x12; // Timer clock is 12T mode
    TMOD     &= ~(TMOD_T0_CT | TMOD_T0_SEL | TMOD_T0_GATE); // Set timer work mode
    TL0      = 0xB0;         // Initial timer value LOW BYTE
    TH0      = 0x3C;         // Initial timer value HIGH BYTE
    TCON_TF0 = CLRBIT;       // Clear TF0 interrupt flag
    ET0      = SETBIT;       // Enable TM0 interrupt
    TCON_TR0 = CLRBIT;       // Timer0 stop running
} // 25ms@24.000MHz


void TM1_Init(void) {
    AUXR    &= ~AUXR_T1x12;  //Timer clock is 12T mode
    TMOD    &= ~(TMOD_T1_CT | TMOD_T1_SEL | TMOD_T1_GATE);  //Set timer work mode
    TL1      = 0xE0;         // Initial timer value LOW BYTE
    TH1      = 0xB1;         // Initial timer value HIGH BYTE
    TCON_TF1 = CLRBIT;       // Clear TF1 flag
    ET1      = SETBIT;       // Enable TM1 interrupt
    TCON_TR1 = CLRBIT;       // Timer1 stop running
} //10ms@24.000MHz

/**
 * @brief TM0 interrupt for updating battery voltage infomation on screen.
 */
void TM0_ISR_Handler(void) interrupt(TM0_VECTOR) {
    static uint8_t n;

    if (++n >= VBAT_UPDATE_FREQ) {
        n = 0;
        G_UpdateVBAT_FLAG    = SETBIT; // Update VBAT info
        G_DisplayUpdate_FLAG = SETBIT; // Refresh VBAT info display
    }
}

void TM1_ISR_Handler(void) interrupt(TM1_VECTOR) {
    if (keyPressedTimeCount >= 0 && keyPressedTimeCount < 255) {
        keyPressedTimeCount++;
    } 
    else {
        keyPressedTimeCount = 255;
    } // Prevent data overflow
    TCON_TF1 = CLRBIT; // Clear TF1 interrupt flag
}

/**
 * @brief INT0 interrupt used to determine the state of the switch button.
 */
void INT0_ISR_Handler(void) interrupt(EXTI0_VECTOR) {
    delay_nms(10); // Jitters elimination

    EX0      = CLRBIT;

    /* Main Interface: Switch Stop/Run state */
    if (!G_State_Settings_FLAG) {
        /* Disable [NEXT/INC] and [LAST/DEC]*/
        P_SW2  |= P_SW2_EAXFR;
        /* Disable I/O interrupt P4.2[NEXT/INC], P2.1[LAST/DEC] */
        P2INTE &= ~0x02;
        P4INTE &= ~0x04;
        P_SW2 &= ~P_SW2_EAXFR;

        if (SW_Button) {
            G_ADC_Running_FLAG = SETBIT;
        } 
        else {
            G_ADC_Running_FLAG = CLRBIT;
        } // Button state detection

        if (G_ADC_Running_FLAG) {
            G_WaveUpdate_FLAG    = SETBIT;
            G_ClearWave_FLAG     = SETBIT;
        }
        else {
            G_DisplayUpdate_FLAG = SETBIT;
            G_WaveUpdate_FLAG    = SETBIT;
        }
        G_ADC_Interrupt_FLAG     = SETBIT;
    }
    EX0      = SETBIT;
    TCON_IE0 = CLRBIT;
}


/**
 * @brief Long pressed key functions
 */
void LPK_functions(void) {
    /* Determine witch key is pressed */
    if (P2INTF) {
        if (P2INTF & 0x01) {
            ADC_Sample_Ready_LED = SETBIT;
        } // P2.0(SEL)

        if (P2INTF & 0x04) {
            ADC_Sample_Ready_LED = SETBIT;
        } // P2.2(EX)
    }

    if (P4INTF) {
        if (P4INTF & 0x02) {
            G_State_Settings_FLAG = ~G_State_Settings_FLAG; // Switch 
            // Enter setting interface
            if (G_State_Settings_FLAG) {
                G_DisplayUpdate_FLAG    = SETBIT;   // Update Screen
                G_UpdateVBAT_FLAG       = SETBIT;   // Update VBAT information
                TCON_TF0                = CLRBIT;   // Clear TM0 overflow flag
                TCON_TR0                = SETBIT;   // TM0 start, preparing for VBAT information updating.
                /* Enable I/O interrupt P4.2[NEXT/INC], P2.1[LAST/DEC] */
                P2INTE |= 0x02;
                P4INTE |= 0x04;
            } // Enter Settings
            else {
                TCON_TR0                = CLRBIT;   // Clear TM0 overflow flag
                TCON_TF0                = CLRBIT;   // TM0 is stopped, suspending the VBAT infomation updating.
                G_WaveFreq              = 0;        // Reset waveform frequency 
                G_TriggerFail_FLAG      = CLRBIT;   // Clear trigger failure flag
                G_VMax                  = 0;        // Reset maximum waveform voltage
                G_VMin                  = 0;        // Reset minimum waveform voltage
                G_DisplayUpdate_FLAG    = SETBIT;   // Update screen display
                G_WaveUpdate_FLAG       = SETBIT;   // Update waveform information
                G_ClearWave_FLAG        = CLRBIT;   // Don't clear waveform on screen
            } // Return to main interface

