HangX-Ma/MiniScpoe-STC8A/User/src/main.c
            G_ADC_Interrupt_FLAG = SETBIT; // Stop sampling ADC information and returned sampled value.
        } // P4.1(SETTING) [Enter/Exit Setting Interface]
    }
}

/**
 * @brief Short pressed key functions
 */
void SPK_functions(void) {
    /* Determine witch key is pressed */
    if (P2INTF) {
        if (P2INTF & 0x01) {
            G_SEL_CONFIRM_FLAG = ~G_SEL_CONFIRM_FLAG;
        } // P2.0(SEL)

        if (P2INTF & 0x02) {
            G_SELOption_Next        = CLRBIT;   // Last value or increase value
            if (!G_State_Settings_FLAG) {
                SelectInChart(G_SELOption_Next);
            } 
            else {
                SelectInSettings(G_SELOption_Next);
            }
            G_ADC_Interrupt_FLAG    = SETBIT;   // ADC sampling process is interrupted by key
            G_DisplayUpdate_FLAG    = SETBIT;   // Update OLED display
        } // P2.1(LAST/DEC)

        if (P2INTF & 0x04) {
            ADC_Sample_Ready_LED = CLRBIT;
        } // P2.2(EX)
    }

    if (P4INTF) {
        if (P4INTF & 0x02) {
            /* In Main Interface */
            if (!G_State_Settings_FLAG)
            {
                G_WaveScroll_FLAG           = ~G_WaveScroll_FLAG; // Change Main Interface Mode
                G_State_OptionChanged_FLAG  = SETBIT;
                G_ADC_Interrupt_FLAG        = SETBIT;
                G_DisplayUpdate_FLAG        = SETBIT;
                G_ClearWave_FLAG            = CLRBIT;
            }
        } // P4.1(SETTING)

        if (P4INTF & 0x04) {
            G_SELOption_Next        = SETBIT;   // Next value or decrease value
            if (!G_State_Settings_FLAG) {
                SelectInChart(G_SELOption_Next);
            } 
            else {
                SelectInSettings(G_SELOption_Next);
            }
            G_ADC_Interrupt_FLAG    = SETBIT;   // ADC sampling process is interrupted by key
            G_DisplayUpdate_FLAG    = SETBIT;   // Update OLED display
        } // P4.2(NEXT/INC)
    }
}


/**
 * @brief Keys I/O interrupt, falling edge detection
 */
void Common_ISR_Handler(void) interrupt(13) {
    delay_nms(20); // Jitters elimination

    P_SW2  |= P_SW2_EAXFR;

    if (!ifKeyPressed) {
        ifKeyPressed        = SETBIT; // Key has been pressed, change I/O trigger method.
        keyPressedTimeCount = 0;      // Clear previous value
        /* Rising edge interrupt */
        P2IM0   |= 0x07;
        P2IM1   &= ~0x07;
        P4IM0   |= 0x06;
        P4IM1   &= ~0x06;
        /* Start TM1 to record the pressing time */
        TCON_TR1 = SETBIT;
    } // Waiting for rising edge (Key released)
    else {
        TCON_TR1     = CLRBIT; // Stop TM1
        ifKeyPressed = CLRBIT; // recover state
        /* Falling edge interrupt */
        P2IM0  &= ~0x07;
        P2IM1  &= ~0x07;
        P4IM0  &= ~0x06;
        P4IM1  &= ~0x06;

        if (keyPressedTimeCount >=50) {
            LPK_functions();
        } // Duration time over 500~600ms, long press
        else {
            SPK_functions();
        } // Duration time within 500~600ms, short press
        keyPressedTimeCount = 0; // Clear previous value
    } // Key released, recover state.
    /* Clear interrupt flag */
    P2INTF &= ~0x07;
    P4INTF &= ~0x06;

    P_SW2 &= ~P_SW2_EAXFR;
}

